src/cf/src/Catalogs/СписокИнформационныхБаз1С/СписокИнформационныхБаз1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокИнформационныхБаз1С</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасположенияИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуБазы_v8i</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверSQL</name>
    <type>
      <types>CatalogRef.СерверыSQL</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыНаСервереSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаДляВыгрузок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выражение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВФормате_v8i</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВебСервисДляОбновленияСпискаБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияПараметровБазы</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ИнформационнойБазы</name>
    <comment>Должен быть уникальным в рамках одной сети</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПравДоступа</name>
    <attributes>
      <name>ОбъектДоступа</name>
      <type>
        <types>CatalogRef.ГруппыПользователейAD</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.ИменаПользователей</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ИсторияПредприятия</name>
      <description>История предприятия</description>
    </items>
    <items>
      <name>СлужебнаяПапка</name>
      <description>Служебная папка</description>
    </items>
  </predefined>
  <attributes>
    <name>ВключеноОбновлениеСпискаБаз1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаAD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуПодразделения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьПользователейАвтоИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеСтруктуреAD</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>EnumRef.ТипРеквизитаAD</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СписокИнформационныхБаз1С/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнформацияПоСлужебнойПапке = СтрШаблон(НСтр("ru = 'Путь к общей служебной папке: %1'"), Справочники.СтруктураПредприятия.СлужебнаяПапка.ПутьККаталогуПодразделения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьФайлыНастроекСпискаБазПользователей(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено  Тогда 
		Для каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
			
			Результат = Ложь;
			ОбновитьФайлыНастроекСпискаБазПользователейСервер(ТекСтрока);
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Обновление настроек списка баз пользователей по элементу %1 завершено.'"),ТекСтрока);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФайлыНастроекСпискаБазПользователейСервер(ИнформационнаяБазаЗапуска) 
	
	Если ИнформационнаяБазаЗапуска.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МассивПользователей = ИнформационнаяБазаЗапуска.СписокПравДоступа.ВыгрузитьКолонку("ОбъектДоступа");	
	
	РаботаСоСтруктуройКаталоговAD.ОбновитьФайлыНастроекСпискаБазПользователейПоСписку(МассивПользователей);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПредприятие(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(ПолучитьКомандуОткрытияВРежимеПредприятия(ТекущиеДанные));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКомандуОткрытияВРежимеПредприятия(ИнформационнаяБаза)
	
	Возврат Справочники.СписокИнформационныхБаз1С.ПолучитьКомандуОткрытияВРежимеПредприятия(ИнформационнаяБаза);
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьКонфигуратор(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(ПолучитьКомандуОткрытияВРежимеКонфигуратора(ТекущиеДанные));

КонецПроцедуры

&НаСервере
Функция ПолучитьКомандуОткрытияВРежимеКонфигуратора(ИнформационнаяБаза)
	
	Возврат Справочники.СписокИнформационныхБаз1С.ПолучитьКомандуОткрытияВРежимеКонфигуратора(ИнформационнаяБаза);
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьПредприятиеВОбычномРежиме(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(ПолучитьКомандуОткрытияВРежимеПредприятия(ТекущиеДанные)+" /RunModeOrdinaryApplication");

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПредприятиеВУправляемомРежиме(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(ПолучитьКомандуОткрытияВРежимеПредприятия(ТекущиеДанные)+" /RunModeManagedApplication");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРезервноеКопированиеБазыДанных(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено  Тогда 
		Для каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
			
			УправлениеРезервнымКопированиемВызовСервера.ВыполнитьРезервноеКопированиеПоНастройке(УправлениеРезервнымКопированиемВызовСервера.СоздатьОбразНастройкиПоЭлементу(ТекСтрока),Истина);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВосстановленияБазыДанных(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено  Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Источник",  ТекущаяСтрока);
	
	ОткрытьФорму("Справочник.СписокИнформационныхБаз1С.Форма.ВосстановлениеИнформационнойБазы", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
